In [1]:
import pandas as pd

record1 = pd.Series({'Name': 'Alice',
                     'class': 'Physics',
                     'Score': 85})

record2 = pd.Series({
    'Name': 'Jack',
    'class': 'Chemistry',
    'Score': 82
})

record3 = pd.Series({
    'Name': 'Helen',
    'class': 'Biology',
    'Score': 90
})

In [2]:
# DataFrame from several series
df = pd.DataFrame([record1, record2, record3], index = ['school1', 'school2', 'school3'])
df.head()

          Name      class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [3]:
# Creating Array of dict
students = [
    {
        'Name': 'Alice',
        'class': 'Physics',
        'Score': 85
    },
    {
        'Name': 'Jack',
        'class': 'Chemistry',
        'Score': 82
    },
    {
        'Name': 'Helen',
        'class': 'Biology',
        'Score': 90
    }]
df = pd.DataFrame(students,index = ['school1', 'school2', 'school1'])
df.head()

          Name      class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [4]:
df.loc['school2']

Name          Jack
class    Chemistry
Score           82
Name: school2, dtype: object

In [5]:
type(df.loc['school2'])

pandas.core.series.Series

In [6]:
df.loc['school1']

          Name    class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [7]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [8]:
df.loc['school1','Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [9]:
# This is similar to the above cell
df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [10]:
df.T

       school1    school2  school1
Name     Alice       Jack    Helen
class  Physics  Chemistry  Biology
Score       85         82       90

In [11]:
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [12]:
# Selecting a column you do not need to use .loc and it is similar to transpose a dataset and then use .loc
df['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [13]:
df.loc[:, ['Name', 'Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school1  Helen     90

In [14]:
df.drop('school1')

         Name      class  Score
school2  Jack  Chemistry     82

In [15]:
df

          Name      class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [16]:
copy_df = df.copy()

copy_df

          Name      class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [17]:
copy_df = df.copy()
copy_df.drop('Name', inplace=True, axis=1)
copy_df

             class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [18]:
del copy_df['class']
copy_df

         Score
school1     85
school2     82
school1     90

In [19]:
df['ClassRanking'] = None
df

          Name      class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school1  Helen    Biology     90         None

# DataFrame Indexing and Loading

In [20]:
df = pd.read_csv('readonly/house_prices.csv')

df.head()

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
0,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,2008-05-21,59222,38.631913,-121.434879
1,51 OMAHA CT,SACRAMENTO,95823,CA,3,1,1167,Residential,2008-05-21,68212,38.478902,-121.431028
2,2796 BRANCH ST,SACRAMENTO,95815,CA,2,1,796,Residential,2008-05-21,68880,38.618305,-121.443839
3,2805 JANETTE WAY,SACRAMENTO,95815,CA,2,1,852,Residential,2008-05-21,69307,38.616835,-121.439146
4,6001 MCMAHON DR,SACRAMENTO,95824,CA,2,1,797,Residential,2008-05-21,81900,38.519470,-121.435768